Напишем программу, которая считывает 
10
10 чисел и определяет, сколько из них больше 
10
10.

counter = 0
for _ in range(10):
    num = int(input())
    if num > 10:
        counter = counter + 1

print('Было введено', counter, 'чисел, больших 10.')

                            **************************************
На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке. Напишите программу, которая подсчитывает сумму введённых чисел (не включая само число n). 
На вход программе подаются натуральное число n, а затем n целых чисел, каждое на отдельной строке

n = int(input())  # Ввод числа n
total = 0  # Переменная для хранения суммы

# Цикл для ввода n чисел
for _ in range(n):
    num = int(input())  # Ввод очередного числа
    total += num  # Добавляем его к сумме

print(total)  # Вывод суммы



                         **********************************************

На вход программе подаётся натуральное число 
nn. Напишите программу, которая вычисляет значение выражения(1+12+13+1n)−ln⁡1 + 1
Формат входных данных
На вход программе подаётся натуральное число n.

Формат выходных данных
Программа должна вывести единственное число в соответствии с условием задачи.

Примечание. Для вычисления натурального логарифма воспользуйтесь функцией log(n), которая находится в модуле math.

import math

# Ввод натурального числа n
n = int(input())

# Вычисляем сумму (1 + 1/2 + 1/3 + ... + 1/n)
total = 0
for i in range(1, n + 1):
    total += 1 / i

# Вычитаем натуральный логарифм ln(n)
result = total - math.log(n)

# Выводим результат
print(result)


