                                               Обратный порядок 2
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.
# Читаем натуральное число
num = int(input("Введите натуральное число: "))

# Переменная для хранения перевёрнутого числа
reversed_num = 0

# Цикл для переворота числа
while num != 0:
    last_digit = num % 10           # Получаем последнюю цифру
    reversed_num = reversed_num * 10 + last_digit  # Добавляем цифру в перевёрнутое число
    num = num // 10                 # Убираем последнюю цифру

# Вывод результата
print(reversed_num)
                        **************************************************************************************************
Дано натуральное число 
n(n≥10) n(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры и выводит текст в следующем формате:

Максимальная цифра равна <максимальная цифра>
Минимальная цифра равна <минимальная цифра>

# Читаем натуральное число n (n ≥ 10)
n = int(input("Введите натуральное число (n ≥ 10): "))

# Инициализация переменных для поиска максимальной и минимальной цифр
max_digit = 0
min_digit = 9

# Цикл для анализа всех цифр числа
while n != 0:
    last_digit = n % 10  # Извлекаем последнюю цифру
    if last_digit > max_digit:
        max_digit = last_digit  # Обновляем максимальную цифру
    if last_digit < min_digit:
        min_digit = last_digit  # Обновляем минимальную цифру
    n = n // 10  # Убираем последнюю цифру

# Вывод результата
print(f"Максимальная цифра равна {max_digit}")
print(f"Минимальная цифра равна {min_digit}")

                  **************************************************************************************************
Все вместе
Дано натуральное число. Напишите программу, которая вычисляет:

сумму его цифр;
количество цифр в нем;
произведение его цифр;
среднее арифметическое его цифр;
его первую цифру;
сумму его первой и последней цифры.
Формат входных данных
На вход программе подаётся одно натуральное число.




# Читаем натуральное число
n = int(input("Введите натуральное число: "))

# Переменные для вычислений
sum_digits = 0
count_digits = 0
product_digits = 1
last_digit = n % 10  # Последняя цифра числа
first_digit = 0

# Работаем с числом
original_n = n  # Сохраняем исходное число для поиска первой цифры
while n != 0:
    digit = n % 10  # Получаем последнюю цифру
    sum_digits += digit  # Суммируем цифры
    product_digits *= digit  # Умножаем цифры
    count_digits += 1  # Увеличиваем счетчик цифр
    first_digit = digit  # Последняя обработанная цифра станет первой цифрой
    n = n // 10  # Убираем последнюю цифру

# Вычисляем среднее арифметическое
average_digits = sum_digits / count_digits

# Сумма первой и последней цифры
sum_first_last = first_digit + last_digit

# Вывод результата
print(sum_digits)  # Сумма цифр
print(count_digits)  # Количество цифр
print(product_digits)  # Произведение цифр
print(average_digits)  # Среднее арифметическое
print(first_digit)  # Первая цифра
print(sum_first_last)  # Сумма первой и последней цифры

                        *******************************************************************************************************
Дано натуральное число n(n>9). Напишите программу, которая определяет его вторую (с начала) цифру.

Формат входных данных
На вход программе подаётся одно натуральное число, состоящее как минимум из двух цифр.

Формат выходных данных
Программа должна вывести его вторую (с начала) цифру.


# Читаем натуральное число
n = int(input("Введите натуральное число (n > 9): "))

# Убираем все цифры, кроме первых двух
while n >= 100:
    n = n // 10

# Вторая цифра — это остаток от деления на 10
second_digit = n % 10

# Вывод результата
print(second_digit)


                     ********************************************************************************************************

                                                           Одинаковые цифры
Дано натуральное число. Напишите программу, которая определяет, состоит ли указанное число из одинаковых цифр.

Формат входных данных
На вход программе подаётся одно натуральное число.

  

# Ввод натурального числа
number = int(input("Введите натуральное число: "))

# Получаем последнюю цифру числа для сравнения
last_digit = number % 10

# Флаг для проверки
all_same = True

# Цикл проверки цифр
while number > 0:
    current_digit = number % 10  # Извлекаем последнюю цифру
    if current_digit != last_digit:
        all_same = False
        break
    number //= 10  # Убираем последнюю цифру

# Вывод результата
if all_same:
    print("Число состоит из одинаковых цифр")
else:
    print("Число не состоит из одинаковых цифр")