                                               Обратный порядок 2
Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.
# Читаем натуральное число
num = int(input("Введите натуральное число: "))

# Переменная для хранения перевёрнутого числа
reversed_num = 0

# Цикл для переворота числа
while num != 0:
    last_digit = num % 10           # Получаем последнюю цифру
    reversed_num = reversed_num * 10 + last_digit  # Добавляем цифру в перевёрнутое число
    num = num // 10                 # Убираем последнюю цифру

# Вывод результата
print(reversed_num)
                        **************************************************************************************************
Дано натуральное число 
n(n≥10) n(n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры и выводит текст в следующем формате:

Максимальная цифра равна <максимальная цифра>
Минимальная цифра равна <минимальная цифра>

# Читаем натуральное число n (n ≥ 10)
n = int(input("Введите натуральное число (n ≥ 10): "))

# Инициализация переменных для поиска максимальной и минимальной цифр
max_digit = 0
min_digit = 9

# Цикл для анализа всех цифр числа
while n != 0:
    last_digit = n % 10  # Извлекаем последнюю цифру
    if last_digit > max_digit:
        max_digit = last_digit  # Обновляем максимальную цифру
    if last_digit < min_digit:
        min_digit = last_digit  # Обновляем минимальную цифру
    n = n // 10  # Убираем последнюю цифру

# Вывод результата
print(f"Максимальная цифра равна {max_digit}")
print(f"Минимальная цифра равна {min_digit}")